// Напишіть функцію яка приймає одне число. При першому виклику, вона його запам'ятовує, при другому - сумує з попереднім і так далі. Для виконання цього завдання використайте замикання. 
// Наприклад:
// sum(3) = 3
// sum(5) = 8
// sum(228) = 236

// function counter(){
//     let count = 0;
//     return function calc(step){
//         count += step;
//         console.log(count);
//     }
// }

// let sum = counter();
// sum(3);
// sum(5);
// sum(228);

// ________________________________________________________

